In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [2]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['W','X','Y','Z'],
                   index = ['Dog','Cat','Birds','Mouse'])

In [3]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Birds   8   9  10  11
Mouse  12  13  14  15

In [10]:
# animals.ix[1:2,['W','Y']]= np.nan

In [9]:
animals.loc[1:2, ['W', 'Y']] = np.nan
animals

C:\Users\defaultuser0\Anaconda3\lib\site-packages\pandas\core\indexing.py:719: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  indexer = self._get_setitem_indexer(key)

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Birds   8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [11]:
behavior_map = {'W':'Good','X':'Bad','Z':'Bad'}

In [12]:
animal_col = animals.groupby(behavior_map,axis=1)

In [13]:
animal_col.sum()

        Bad  Good
Dog     4.0   0.0
Cat    12.0   0.0
Birds  20.0   8.0
Mouse  28.0  12.0

In [14]:
behave_series = Series(behavior_map)

In [15]:
behave_series

W    Good
X     Bad
Z     Bad
dtype: object

In [16]:
animals.groupby(behave_series,axis=1).count()

       Bad  Good
Dog      2     1
Cat      2     0
Birds    2     1
Mouse    2     1

In [17]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Birds   8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [18]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
5  20.0  22  24.0  26

In [19]:
keys = ['A','B','A','B']

In [20]:
animals.groupby([len,keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
5 A   8.0   9  10.0  11
  B  12.0  13  14.0  15

In [21]:
hier_col = pd.MultiIndex.from_arrays([['brm','btm','btm','dmk','dmk'],[1,2,3,1,2]],names=['city','sub_value'])

In [22]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns=hier_col )

In [24]:
dframe_hr = dframe_hr*100

In [25]:
dframe_hr

city        brm   btm         dmk
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400